soap-client/HelloWorld.wsdl

<!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS 
	RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS 
	RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<definitions
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy"
	xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:tns="http://impl.service.server.soap.arpit.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://impl.service.server.soap.arpit.com/"
	name="HelloWorldServiceImplService">
	<import namespace="http://service.server.soap.arpit.com/"
		location="http://localhost:9999/service/hello-world?wsdl=1" />
	<binding xmlns:ns1="http://service.server.soap.arpit.com/"
		name="HelloWorldServiceImplPortBinding" type="ns1:HelloWorldService">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"
			style="document" />
		<operation name="helloWorld">
			<soap:operation
				soapAction="https://aggarwalarpit.wordpress.com/hello-world/helloWorld" />
			<input>
				<soap:body use="literal" parts="parameters" />
				<soap:header message="ns1:helloWorld" part="arg1" use="literal" />
			</input>
			<output>
				<soap:body use="literal" />
			</output>
		</operation>
	</binding>
	<service name="HelloWorldServiceImplService">
		<port name="HelloWorldServiceImplPort" binding="tns:HelloWorldServiceImplPortBinding">
			<soap:address location="http://localhost:9999/service/hello-world" />
		</port>
	</service>
</definitions>