basic-soap-server-client/README.md

### Info

this directory contains a replica of [masic soap project](https://github.com/arpitaggarwal/soap) with minimal upgrades to later spring-boot version

### Usage

#### Server

* change to directory `server` and run command 
```
pushd server
mvn spring-boot:run
```

 * examine the WSDL 

```sh
curl -s -X GET http://localhost:9999/service/hello-world?wsdl
```

```sh
curl -s -X GET http://localhost:9999/service/hello-world?wsdl | xmlstarlet fo  -
```

```XML
<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://impl.service.server.soap.arpit.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://impl.service.server.soap.arpit.com/" name="HelloWorldServiceImplService">
  <import namespace="http://service.server.soap.arpit.com/" location="http://localhost:9999/service/hello-world?wsdl=1"/>
  <binding xmlns:ns1="http://service.server.soap.arpit.com/" name="HelloWorldServiceImplPortBinding" type="ns1:HelloWorldService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="helloWorld">
      <soap:operation soapAction="https://aggarwalarpit.wordpress.com/hello-world/helloWorld"/>
      <input>
        <soap:body use="literal" parts="parameters"/>
        <soap:header message="ns1:helloWorld" part="arg1" use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="HelloWorldServiceImplService">
    <port name="HelloWorldServiceImplPort" binding="tns:HelloWorldServiceImplPortBinding">
      <soap:address location="http://localhost:9999/service/hello-world"/>
    </port>
  </service>
</definitions>

```
* NOTE: some formatting commands do not work (the result is not indented)

```sh
xmlstarlet fo -t "$(curl -s -X GET http://localhost:9999/service/hello-world?wsdl)"
```

### Client

* change to directory `client` and run command 
```sh
pushd client
mvn spring-boot:run
```
### Sample SOAP Request Payload

```XML
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.server.soap.arpit.com/">
   <soapenv:Header>
      <ser:arg1>
         <userId>arpit</userId>
         <password>arpit</password>
      </ser:arg1>
   </soapenv:Header>
   <soapenv:Body>
      <ser:helloWorld>
         <!--Optional:-->
         <arg0>Arpit</arg0>
      </ser:helloWorld>
   </soapenv:Body>
</soapenv:Envelope>
```

### Sample Response

```XML
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <ns2:helloWorldResponse xmlns:ns3="https://aggarwalarpit.wordpress.com" xmlns:ns2="http://service.server.soap.arpit.com/">
         <return>Hello World from Arpit</return>
      </ns2:helloWorldResponse>
   </S:Body>
</S:Envelope>
```

### NOTE: 

* the code references `https://aggarwalarpit.wordpress.com/hello-world/helloWorld` but works on the machine without the internet connection
* modifying package names may lead to runtime errors

